module.exports = {
    choose_lang: `Choose your language\nОберіть мову\nВыберите язык`,
    
    language_set: {
        "en": "Language set to English 🇬🇧",
        "ua": "Встановленна Українська мова 🇺🇦",
        "ru": "Установлен Русский язык 🇷🇺",
    },

    short_desc: {
        "ua": "🎉 Конкурс на 10 000$!\n\nВи маєте унікальну можливість виграти частину призового фонду в 10 000$. Умови прості: підпишіться на наші соцмережі, зробіть покупку $PCT токенів і тримайте їх до кінця конкурсу. Беріть участь та отримайте шанс на виграш! 💰🚀"
    },

    not_subscribed: {
        "ua": "Ви не підписані на наш канал!",
        "ru": "Вы не подписаны на наш канал!",
        "en": "You are not subscribed to our channel!"
    }
}