module.exports = {
    choose_lang: `Choose your language\nОберіть мову\nВыберите язык`,
    
    language_set: {
        "en": "Language set to English 🇬🇧",
        "ua": "Встановленна Українська мова 🇺🇦",
        "ru": "Установлен Русский язык 🇷🇺",
    },

    short_desc: {
        "en": "🎉 Giveaway with 100 prize spots and a total pool of $10,000 in $PCT tokens!\n\nYou have a unique opportunity to win a share of the $10,000 prize pool. The rules are simple: follow us on social media. Join in and get your chance to win! 💰🚀",
        "ua": "🎉 Конкурс на 100 призових місць і загальним пулом в 10 000$ у токенах $PCT!\n\nВи маєте унікальну можливість виграти частину призового фонду в 10 000$. Умови прості: підпишіться на наші соцмережі, зробіть покупку $PCT токенів і тримайте їх до кінця конкурсу. Беріть участь та отримайте шанс на виграш! 💰🚀",
        "ru": "🎉 Конкурс на 100 призовых мест с общим пулом в 10 000$ в токенах $PCT!\n\nУ вас есть уникальная возможность выиграть часть призового фонда в 10 000$. Условия просты: подпишитесь на наши социальные сети. Участвуйте и получите шанс на победу! 💰🚀"
    },

    not_subscribed: {
        "ua": "❌ Ви не підписані на наш канал! ❌",
        "ru": "❌ Вы не подписаны на наш канал! ❌",
        "en": "❌ You are not subscribed to our channel! ❌"
    },

    conditions: {
        "ua": "🔥 Роздача $10 000 у токенах $PCT для 100 переможців! 💰\n\n❇️Умови конкурсу:\n\n🐦Слідкуйте за нами у Twitter - https://x.com/PeacyTron\n🖥Слідкуйте за нами у YouTube - https://www.youtube.com/@PeacyTron\n📱Слідкуйте за нами у TikTok -\n📞Приєднуйтесь до нашого Telegram - https://t.me/peacytron\n🔁Репост цього посту у Twitter -",
        "ru": "🔥 Раздача $10 000 в токенах $PCT для 100 победителей! 💰\n\n❇️ Условия конкурса:\n\n🐦 Следите за нами в Twitter - https://x.com/PeacyTron\n🖥 Следите за нами на YouTube - https://www.youtube.com/@PeacyTron\n📱 Следите за нами в TikTok -\n📞 Присоединяйтесь к нашему Telegram - https://t.me/peacytron\n🔁 Репост этого поста в Twitter -",
        "en": "🔥 $10,000 Giveaway in $PCT tokens for 100 winners! 💰\n\n❇️ Contest Rules:\n\n🐦 Follow us on Twitter - https://x.com/PeacyTron\n🖥 Follow us on YouTube - https://www.youtube.com/@PeacyTron\n📱 Follow us on TikTok -\n📞 Join our Telegram - https://t.me/peacytron\n🔁 Repost this post on Twitter -",
    },

    conditions2: {
        "ua": "🔥 Роздача $10 000 у токенах $PCT для 100 переможців! 💰\n\n❇️Умови конкурсу:\n\n🐦Слідкуйте за нами у Twitter - https://x.com/PeacyTron\n🖥Слідкуйте за нами у YouTube - https://www.youtube.com/@PeacyTron\n📱Слідкуйте за нами у TikTok -\n📞Приєднуйтесь до нашого Telegram - https://t.me/peacytron\n🔁Репост цього посту у Twitter -\n\n👉 Купуйте $PCT тут - https://peacytron.com/\n\n🎁Результати розіграшу будуть - 01.12.2024",
        "ru": "🔥 Раздача $10 000 в токенах $PCT для 100 победителей! 💰\n\n❇️ Условия конкурса:\n\n🐦 Следите за нами в Twitter - https://x.com/PeacyTron\n🖥 Следите за нами на YouTube - https://www.youtube.com/@PeacyTron\n📱 Следите за нами в TikTok -\n📞 Присоединяйтесь к нашему Telegram - https://t.me/peacytron\n🔁 Репост этого поста в Twitter -\n\n👉 Покупайте $PCT здесь - https://peacytron.com/\n\n🎁 Результаты розыгрыша будут объявлены - 01.12.2024",
        "en": "🔥 $10,000 Giveaway in $PCT tokens for 100 winners! 💰\n\n❇️ Contest Rules:\n\n🐦 Follow us on Twitter - https://x.com/PeacyTron\n🖥 Follow us on YouTube - https://www.youtube.com/@PeacyTron\n📱 Follow us on TikTok -\n📞 Join our Telegram - https://t.me/peacytron\n🔁 Repost this post on Twitter -\n\n👉 Buy $PCT here - https://peacytron.com/\n\n🎁 The giveaway results will be announced on 01.12.2024",
    },

    enter_trx_wallet: {
        "ua": "📝 Введіть вашу TRX адрессу\n( TronLink або любий Web3 гаманець, не вводіть адрессу TRX з бірж!)👇",
        "ru": "📝 Введите ваш TRX адрес\n( TronLink либо другой Web3 кошелек, не вводите адрес TRX с бирж!)👇",
        "en": "📝 Enter your TRX address\n( TronLink or any other Web3 wallet, do not enter TRX address from birges!)👇"
    },

    check_trx_wallet: {
        "ua": "⛔️Підтвердіть адресу гаманця TRX⛔️\n\nНагадуємо що адреси з криптовалютних бірж не підходять❗️\nПотрібно вказувати адресу з гаманця TronLink, OKX Web3 або інших децентралізованих гаманців!  ",
        "ru": "⛔️ Подтвердите адрес кошелька TRX ⛔️\n\nНапоминаем, что адреса с криптовалютных бирж не подходят❗️\nНеобходимо указывать адрес с кошелька TronLink, OKX Web3 или других децентрализованных кошельков! 🚀",
        "en": "⛔️ Confirm your TRX wallet address ⛔️\n\nPlease note that addresses from cryptocurrency exchanges are not suitable❗️\nYou need to provide an address from TronLink, OKX Web3, or other decentralized wallets! 🚀"
    },

    ready_conditions: {
        "en": "Congratulations! 🎉 You have successfully completed all the contest requirements! You have now automatically received your tickets for the giveaway. Each invited friend who also completes the contest requirements adds more tickets 🎟, increasing your chances of winning! Invite friends and get closer to victory! 🚀\n\n🎁 The giveaway results will be announced on 01.12.2024\n\n🎟Number of tickets - {tick}\n\n👥Referral link - {ref}",
        "ru": "Поздравляем! 🎉 Вы успешно выполнили все условия конкурса! Теперь вы автоматически получили свои билеты для участия в розыгрыше. Каждый приглашенный друг, который также выполнит условия конкурса, добавит вам еще больше билетов 🎟, увеличивая ваши шансы на победу! Приглашайте друзей и приближайтесь к победе! 🚀\n\n🎁 Результаты розыгрыша будут объявлены - 01.12.2024\n\n🎟 Количество билетов - {tick}\n\n👥 Реферальная ссылка - {ref}",
        "ua": "Вітаємо! 🎉 Ви успішно виконали всі умови конкурсу! Тепер ви автоматично отримали свої білети для участі у розіграші. Кожен запрошений друг, який також виконає умови конкурсу, додає вам ще більше білетів 🎟, збільшуючи ваші шанси на виграш! Запрошуйте друзів і наближайтеся до перемоги! 🚀\n\n🎁Результати розіграшу будуть - 01.12.2024\n\n🎟Кількість білетів - {tick}\n\n👥Реф посилання - {ref}"
    },

    main_menu: {
        "en": "Main menu",
        "ua": "Головне меню",
        "ru": "Главное меню"
    },

    stats: {
        "en": "🎟 Your tickets - {tick} \n👥 Referal link: {ref}",
        "ua": "🎟 Кількість квитків - {tick} \n👥 Реф посилання: {ref}",
        "ru": "🎟 Количество билетов - {tick} \n👥 Реф ссылка: {ref}"
    },

    top10: {
        "en": "🏆 Top 10",
        "ua": "🏆 Топ 10",
        "ru": "🏆 Топ 10"
    },

    buy_pct: {
        "en": "💎 Buy $PCT\n\n👉 https://peacytron.com/ 👈",
        "ua": "💎 Купити $PCT\n\n👉 https://peacytron.com/ 👈",
        "ru": "💎 Купить $PCT\n\n👉 https://peacytron.com/ 👈"
    },

    failed_referal: {
        "en": "❌ Failed to add referral",
        "ua": "❌ Не вдалося додати реферал",
        "ru": "❌ Не удалось добавить реферала"
    },



    sub_to_chanel_btn: {
        "en": "Subscribe",
        "ua": "Підписатися",
        "ru": "Подписаться"
    },

    next_btn: {
        "en": "Next",
        "ua": "Далі",
        "ru": "Далее"
    },
    



    check_trx_approve_btn: {
        "en": "✅ Approve",
        "ua": "✅ Підтвердити",
        "ru": "✅ Подтвердить"
    },

    check_trx_edit_btn: {
        "en": "✏️ Edit",
        "ua": "✏️ Редагувати",
        "ru": "✏️ Изменить"
    },



    main_menu_conditions_btn: {
        "en": "📚 Conditions 📚",
        "ua": "📚 Умови конкурсу 📚",
        "ru": "📚 Условия конкурса 📚"
    },

    main_menu_stat_btn: {
        "en": "📊 My Statistics 📊",
        "ua": "📊 Моя Статистика 📊",
        "ru": "📊 Моя Статистика 📊"
    },

    main_menu_top10_btn: {
        "en": "🏆 Top 10 🏆",
        "ua": "🏆 Топ 10 🏆",
        "ru": "🏆 Топ 10 🏆"
    },

    main_menu_buy_pct_btn: {
        "en": "🤑 Buy $PCT 🤑",
        "ua": "🤑 Купити $PCT 🤑",
        "ru": "🤑 Купить $PCT 🤑"
    },
    
    main_menu_change_language_btn: {
        "en": "🌐 Change language 🌐",
        "ua": "🌐 Змінити мову 🌐",
        "ru": "🌐 Изменить язык 🌐"
    }
}