module.exports = {
    choose_lang: `Choose your language\nОберіть мову\nВыберите язык`,
    
    language_set: {
        "en": "Language set to English 🇬🇧",
        "ua": "Встановленна Українська мова 🇺🇦",
        "ru": "Установлен Русский язык 🇷🇺",
    },

    short_desc: {
        "en": "🎉 $10,000 Giveaway!\n\nYou have a unique opportunity to win a share of the $10,000 prize pool. The rules are simple: follow us on social media. Join in and get your chance to win! 💰🚀",
        "ua": "🎉 Конкурс на 10 000$!\n\nВи маєте унікальну можливість виграти частину призового фонду в 10 000$. Умови прості: підпишіться на наші соцмережі, зробіть покупку $PCT токенів і тримайте їх до кінця конкурсу. Беріть участь та отримайте шанс на виграш! 💰🚀",
        "ru": "🎉 Конкурс на 10 000$!\n\nУ вас есть уникальная возможность выиграть часть призового фонда в 10 000$. Условия просты: подпишитесь на наши социальные сети. Участвуйте и получите шанс на победу! 💰🚀"
    },

    not_subscribed: {
        "ua": "Ви не підписані на наш канал!",
        "ru": "Вы не подписаны на наш канал!",
        "en": "You are not subscribed to our channel!"
    },

    conditions: {
        "ua": "🔥 Роздача $10 000 у токенах $PCT! 💰\n\n❇️Умови конкурсу:\n\n🐦Слідкуйте за нами у Twitter - https://x.com/PeacyTron\n🖥Слідкуйте за нами у YouTube - \n📱Слідкуйте за нами у TikTok -\n📞Приєднуйтесь до нашого Telegram - https://t.me/peacytron\n🔁Репост цього посту у Twitter -",
        "ru": "🔥 Раздача $10 000 в токенах $PCT! 💰\n\n❇️ Условия конкурса:\n\n🐦 Следите за нами в Twitter - https://x.com/PeacyTron\n🖥 Следите за нами на YouTube -\n📱 Следите за нами в TikTok -\n📞 Присоединяйтесь к нашему Telegram - https://t.me/peacytron\n🔁 Репост этого поста в Twitter -",
        "en": "🔥 $10,000 Giveaway in $PCT tokens! 💰\n\n❇️ Contest Rules:\n\n🐦 Follow us on Twitter - https://x.com/PeacyTron\n🖥 Follow us on YouTube -\n📱 Follow us on TikTok -\n📞 Join our Telegram - https://t.me/peacytron\n🔁 Repost this post on Twitter -",
    },

    conditions2: {
        "ua": "🔥 Роздача $10 000 у токенах $PCT! 💰\n\n❇️Умови конкурсу:\n\n🐦Слідкуйте за нами у Twitter - https://x.com/PeacyTron\n🖥Слідкуйте за нами у YouTube - \n📱Слідкуйте за нами у TikTok -\n📞Приєднуйтесь до нашого Telegram - https://t.me/peacytron\n🔁Репост цього посту у Twitter -\n\n👉 Купуйте $PCT тут - https://peacytron.com/",
        "ru": "🔥 Раздача $10 000 в токенах $PCT! 💰\n\n❇️ Условия конкурса:\n\n🐦 Следите за нами в Twitter - https://x.com/PeacyTron\n🖥 Следите за нами на YouTube -\n📱 Следите за нами в TikTok -\n📞 Присоединяйтесь к нашему Telegram - https://t.me/peacytron\n🔁 Репост этого поста в Twitter -\n\n👉 Покупайте $PCT здесь - https://peacytron.com/",
        "en": "🔥 $10,000 Giveaway in $PCT tokens! 💰\n\n❇️ Contest Rules:\n\n🐦 Follow us on Twitter - https://x.com/PeacyTron\n🖥 Follow us on YouTube -\n📱 Follow us on TikTok -\n📞 Join our Telegram - https://t.me/peacytron\n🔁 Repost this post on Twitter -\n\n👉 Buy $PCT here - https://peacytron.com/",
    },

    enter_trx_wallet: {
        "ua": "Введіть вашу TRX адрессу",
        "ru": "Введите ваш TRX адрес",
        "en": "Enter your TRX address"
    },

    ready_conditions: {
        "en": "Congratulations! 🎉 You have successfully completed all the contest requirements! You have now automatically received your tickets for the giveaway. Each invited friend who also completes the contest requirements adds more tickets 🎟, increasing your chances of winning! Invite friends and get closer to victory! 🚀\n\n🎟Number of tickets - {tick}\n\n👥Referral link - {ref}",
        "ru": "Поздравляем! 🎉 Вы успешно выполнили все условия конкурса! Теперь вы автоматически получили свои билеты для участия в розыгрыше. Каждый приглашенный друг, который также выполнит условия конкурса, добавит вам еще больше билетов 🎟, увеличивая ваши шансы на победу! Приглашайте друзей и приближайтесь к победе! 🚀\n\n🎟 Количество билетов - {tick}\n\n👥 Реферальная ссылка - {ref}",
        "ua": "Вітаємо! 🎉 Ви успішно виконали всі умови конкурсу! Тепер ви автоматично отримали свої білети для участі у розіграші. Кожен запрошений друг, який також виконає умови конкурсу, додає вам ще більше білетів 🎟, збільшуючи ваші шанси на виграш! Запрошуйте друзів і наближайтеся до перемоги! 🚀\n\n🎟Кількість білетів - {tick}\n\n👥Реф посилання - {ref}"
    },

    main_menu: {
        "en": "Main menu",
        "ua": "Головне меню",
        "ru": "Главное меню"
    },

    stats: {
        "en": "Your tickets - {tick}\nReferal link: {ref}",
        "ua": "Кількість квитків - {tick} \nРеф посилання: {ref}",
        "ru": "Количество билетов - {tick} \nРеф ссылка: {ref}"
    },

    top10: {
        "en": "Top 10",
        "ua": "Топ 10",
        "ru": "Топ 10"
    },

    buy_pct: {
        "en": "Buy $PCT\n\nhttps://peacytron.com/",
        "ua": "Купити $PCT\n\nhttps://peacytron.com/",
        "ru": "Купить $PCT\n\nhttps://peacytron.com/"
    },





    main_menu_conditions_btn: {
        "en": "Conditions",
        "ua": "Умови конкурсу",
        "ru": "Условия конкурса"
    },

    main_menu_stat_btn: {
        "en": "My Statistics",
        "ua": "Моя Статистика",
        "ru": "Моя Статистика"
    },

    main_menu_top10_btn: {
        "en": "Top 10",
        "ua": "Топ 10",
        "ru": "Топ 10"
    },

    main_menu_buy_pct_btn: {
        "en": "Buy $PCT",
        "ua": "Купити $PCT",
        "ru": "Купить $PCT"
    },
}